title: week 9 assignment sigma rule
status: test
description: Detects when the bitsadmin process is ran with an unusual parent
references:
   - https://github.com/EvaStanAccount/IT4077/blob/Main/Week10.ps1
author: Ian Listopad @ilistopad303
date: 2024-10-31
logsource:
  category: process_creation
  product: windows
detection:
    parent_process:
        Image|endswith: '\cmd.exe'
        ParentImage|endswith:
            - '\powershell.exe'
    selection_img:
        - winlog.event_data.Image|endswith: '\bitsadmin.exe'
        - winlog.event_data.OriginalFileName: 'bitsadmin.exe'
    selection_cmd:
        winlog.event_data.CommandLine|contains: ' /transfer '
    selection_cli_1:
        winlog.event_data.CommandLine|contains:
            - ' /create '
            - ' /addfile '
    selection_cli_2:
        winlog.event_data.CommandLine|contains: 'http'
    condition: selection_img and (selection_cmd or all of selection_cli_*) and parent_process