title: week 11 assignment sigma rule
status: test
description: Detection for the scheduled task creation
references:
   - https://www.sentinelone.com/labs/agent-tesla-old-rat-uses-new-tricks-to-stay-on-top/
author: Ian Listopad @ilistopad303
date: 2024-11-08
logsource:
  product: windows
detection:
    schtask_command:
      - winlog.event_data.CommandLine|contains: 'schtasks /Create'
      - winlog.event_data.CommandLine|contains: 'AppDataLocalTemp'
    condition: schtask_command